package com.indeed.vo.whiteboard;

/* =============================================================================
Follow Up

优化复杂度
=============================================================================*/

/* =============================================================================
Follow Up code
=============================================================================*/
//记忆化搜索解法，复杂度一定比DP要低，就是低到哪里去不太好计算。
//复杂度是 O（状态的个数*状态转移的复杂度），是O(6 * dice)，因为每次只向下查6个。
//anyway，这个是最优解。面试时候直接给这个就行吧。

public class Dice_Sum_FollowUp {
    //public double getPossibility(int dice, int target)

}
